In [1]:
import pandas as pd

In [25]:
df = pd.read_csv('data/titanic.csv')

mask = (df['Age'] >= 35) & (df['Age'] <= 45) & (df['Pclass'] > 1) & (df['Sex'] == 'male')
df[mask].Fare.describe()

count    67.000000
mean     13.058081
std       9.357217
min       0.000000
25%       7.822900
50%       8.050000
75%      15.525000
max      56.495800
Name: Fare, dtype: float64

In [50]:
mask = df['Name'].str.contains('Chaffee')
df[mask]

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
91,0,1,Mr. Herbert Fuller Chaffee,male,46.0,1,0,61.175